"use client"

import * as React from "react"
import axios from "@/lib/axios"

import { EURSearchForm } from "./form"
import { SearchResult } from "./result-card"

export type EURresponse = {
    answer: string
    source: {id: number | string, content: string}[]
}

interface EURSearchProps {
  id: number
}

export function EURSearch({id}: EURSearchProps) {
  const [query, setQuery] = React.useState<string>("")
  const [loading, setLoading] = React.useState<boolean>(false)
  const [result, setResult] = React.useState<EURresponse | null>(null)

  const handleSubmit = async (e: React.FormEvent<HTMLFormElement>) => {
    e.preventDefault()
    if (query) {
      setLoading(true)
      setResult(null)
      try{
        const {data} = await axios.get(`/eur?query=${query}&chain=stuff`)
        console.log(data)
        setResult(data)
      }catch(err){
        console.log(err)
        setResult(null)
      }
      setLoading(false)

      // setTimeout(() => {
      //   setResult(fakeData)
      //   setLoading(false)
      // }, 3000)
    }
  }

  return (
    <>
      <EURSearchForm
        onSubmit={handleSubmit}
        query={query}
        setQuery={setQuery}
        loading={loading}
        id={id}
      />
      {(result || loading) && <SearchResult data={result} />}
    </>
  )
}

const fakeData: EURresponse = {
    "answer": "Зазначається вага брутто (в кілограмах, тоннах) товару, описаного в графі 8, або кількість в інших одиницях виміру.",
    "source": [
        {
            "content": "При цьому в графі 8 сертифіката EUR.1 або EUR-MED робиться посилання на відповідний рахунок-фактуру або інший комерційний документ із зазначенням його реквізитів і кількості аркушів, з яких він складається. Кожний аркуш рахунка-фактури або іншого комерційного документа, що містить відомості про походження товару(ів), посадова особа митниці засвідчує особистим підписом з проставленням особистої номерної печатки.\n\nГрафа 9 \"Повна маса (кг) або інші виміри (літри, куб. м тощо)\"\n\nЗазначається вага брутто (в кілограмах, тоннах) товару(ів), описаного(их) в графі 8, або кількість товару(ів) в інших одиницях виміру.\n\nГрафа 10 \"Інвойси\"\n\nГрафа заповнюється за бажанням експортера. У разі заповнення у графі зазначаються номер і дата складання рахунка-фактури (рахунків-фактур) або іншого комерційного документа, який було оформлено на зазначений(і) в графі 8 товар(и).\n\nГрафа 11 \"Митний дозвіл\"\n\nГрафу заповнює посадова особа митниці.",
            "id": 1
        },
        {
            "content": "Графа 9 - «Загальна маса (кг) або інші одиниці виміру (літри, м-3 та інші)»\n\nЗазначається вага брутто (в кілограмах, тоннах) товару, описаного в графі 8, або кількість в інших одиницях виміру.\n\nГрафа 10\n\n\n\n«Рахунки\n\n\n\nфактури»\n\nГрафа заповнюється за бажанням експортера. У разі заповнення у графі зазначаються номер та дата складання рахунка-фактури (рахунків-фактур) або іншого комерційного документа, який був оформлений на зазначені в графі 8 товари.\n\nГрафа 11\n\n\n\n«Підтвердження митниці»\n\nГрафа заповнюється посадовою особою митниці.\n\nПісля слів «Відділення митниці» зазначається найменування митниці, що видає сертифікат.\n\nПісля слів «Країна або територія, що видала» зазначається назва країни: Україна.\n\nПісля слів «Місце та дата» зазначаються назва міста та дата видачі сертифіката.\n\nСертифікат засвідчується підписом посадової особи митниці та проставленням особистої номерної печатки.\n\nГрафа 12\n\n\n\n«Декларація експортера»",
            "id": 2
        },
        {
            "content": "Товар(и) слід описувати таким чином, щоб його (їх) можливо було однозначно ідентифікувати. Після виконання в цій графі останнього запису накреслюється горизонтальна лінія, а вільний простір перекреслюється по діагоналі, щоб не залишалося місця для додаткових записів. Якщо відправлення товарів, що експортуються, складається з різних видів товарів і в графі недостатньо місця для опису усіх товарів, їх можна не описувати в графі 8, а зазначити в рахунку-фактурі або в іншому комерційному документі за умови, що номери цих рахунків-фактур або інших комерційних документів будуть зазначені в графі 10 сертифіката.\n\nПри цьому в графі 8 сертифіката робиться посилання на відповідний рахунок-фактуру або інший комерційний документ із зазначенням його реквізитів і кількості аркушів, з яких він складається. Відомості про походження товарів у рахунку-фактурі або іншому комерційному документі засвідчуються особистим підписом посадової особи митниці та проставленням номерної печатки.",
            "id": 3
        },
        {
            "content": "Зазначається назва країни: Україна.\n\nУ разі видачі сертифіката на основі попередньо оформленого або виданого підтвердження походження згідно з вимогами розділу VI цього Порядку у графі зазначається назва країни:\n\nРеспубліка Ісландія, або Королівство Норвегія, або Швейцарська Конфедерація.\n\nГрафа 5 - «Країна, група країн або територій призначення»\n\nЗазначається назва країни: Україна, або Республіка Ісландія, або Королівство Норвегія, або Швейцарська Конфедерація, або Князівство Ліхтенштейн.\n\nГрафа 6\n\n\n\n«Особливості транспортування»\n\nГрафа заповнюється за бажанням експортера. У разі заповнення у графі зазначаються відомості про транспортний засіб, який доставляє товари, що експортуються, та його маршрут переміщення. Якщо невідомо, який транспортний засіб прибуде в країну, ця графа не заповнюється.\n\nГрафа 7\n\n\n\n«Зауваження»",
            "id": 4
        }
    ]
}
